dinner-with/app/controllers/request_controller.rb

  def create
    @request = Request.new(params[:request])
    if @request.save
---
INSERT INTO "requests" ("amount", "created_at", "mondo_id", "transaction_id", "updated_at", "who_from") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", nil], ["created_at", Sun, 21 Feb 2016 03:51:46 UTC +00:00], ["mondo_id", "1"], ["transaction_id", "123"], ["updated_at", Sun, 21 Feb 2016 03:51:46 UTC +00:00], ["who_from", nil]]